toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
#include <msp430.h>
#include <stdint.h>
#include <stdbool.h>
#include <inttypes.h>
#include <cstddef>
#include <atomic>
#define TaskMSP430
#include "Toastbox/Task.h"
#include "SDCard.h"
#include "ICE.h"
#include "ImgSensor.h"
#include "ImgAutoExposure.h"
#include "Startup.h"
#include "GPIO.h"
#include "Clock.h"
#include "RTC.h"
#include "SPI.h"
#include "WDT.h"
#include "FRAMWriteEn.h"
#include "Util.h"
#include "MSP.h"
#include "GetBits.h"
#include "Toastbox/IntState.h"
#include "ImgSD.h"
using namespace GPIO;

static constexpr uint64_t _MCLKFreqHz       = 16000000;
static constexpr uint32_t _XT1FreqHz        = 32768;
static constexpr uint32_t _SysTickPeriodUs  = 512;

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line);

struct _Pin {
    // Default GPIOs
    using VDD_B_1V8_IMG_EN                  = PortA::Pin<0x0, Option::Output0>;
    using VDD_B_EN                          = PortA::Pin<0x1, Option::Output0>;
    using VDD_B_2V8_IMG_EN                  = PortA::Pin<0x2, Option::Output0>;
    using MOTION_SIGNAL                     = PortA::Pin<0x3, Option::Interrupt01, Option::Resistor0>; // Motion sensor can only pull up, so it requires a pulldown resistor
    using ICE_MSP_SPI_DATA_OUT              = PortA::Pin<0x4>;
    using ICE_MSP_SPI_DATA_IN               = PortA::Pin<0x5>;
    using ICE_MSP_SPI_CLK                   = PortA::Pin<0x6>;
    using XOUT                              = PortA::Pin<0x8>;
    using XIN                               = PortA::Pin<0x9>;
    using VDD_B_SD_EN                       = PortA::Pin<0xB, Option::Output0>;
    using DEBUG_OUT                         = PortA::Pin<0xD, Option::Output0>;
    using HOST_MODE_                        = PortA::Pin<0xE, Option::Input, Option::Resistor0>;
};

// _MotionSignalIV: motion interrupt vector; keep in sync with the pin chosen for MOTION_SIGNAL
constexpr uint16_t _MotionSignalIV = P1IV__P1IFG3;

using _Clock = ClockType<_MCLKFreqHz>;
using _SysTick = WDTType<_MCLKFreqHz, _SysTickPeriodUs>;
using _SPI = SPIType<_MCLKFreqHz, _Pin::ICE_MSP_SPI_CLK, _Pin::ICE_MSP_SPI_DATA_OUT, _Pin::ICE_MSP_SPI_DATA_IN>;

class _MainTask;
class _SDTask;
class _ImgTask;

static void _Sleep();

static void _SchedulerError(uint16_t line);
static void _ICEError(uint16_t line);
static void _SDError(uint16_t line);
static void _ImgError(uint16_t line);

extern uint8_t _StackMain[];

#warning disable stack guard for production
static constexpr size_t _StackGuardCount = 16;
using _Scheduler = Toastbox::Scheduler<
    _SysTickPeriodUs,                           // T_UsPerTick: microseconds per tick
    Toastbox::IntState::SetInterruptsEnabled,   // T_SetInterruptsEnabled: function to change interrupt state
    _Sleep,                                     // T_Sleep: function to put processor to sleep;
                                                //          invoked when no tasks have work to do
    _SchedulerError,                            // T_Error: function to handle unrecoverable error
    _StackMain,                                 // T_MainStack: main stack pointer (only used to monitor
                                                //              main stack for overflow; unused if T_StackGuardCount==0)
    _StackGuardCount,                           // T_StackGuardCount: number of pointer-sized stack guard elements to use
    _MainTask,                                // T_Tasks: list of tasks
    _SDTask,
    _ImgTask
>;

using _ICE = ICE<
    _Scheduler,
    _ICEError
>;

// _ImgSensor: image sensor object
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
using _ImgSensor = Img::Sensor<
    _Scheduler,             // T_Scheduler
    _ICE,                   // T_ICE
    _ImgError               // T_Error
>;

// _SDCard: SD card object
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
using _SDCard = SD::Card<
    _Scheduler,         // T_Scheduler
    _ICE,               // T_ICE
    _SDError,           // T_Error
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    0                   // T_ClkDelayFast (odd values invert the clock)
>;

using _RTCType = RTC::Type<_XT1FreqHz, _Pin::XOUT, _Pin::XIN>;

// _RTC: real time clock
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
// 
// _RTC needs to live in the _noinit variant, so that RTC memory
// is never automatically initialized, because we don't want it
// to be reset when we abort.
[[gnu::section(".ram_backup_noinit.main")]]
static _RTCType _RTC;

// _State: stores MSPApp persistent state, intended to be read/written by outside world
// Stored in 'Information Memory' (FRAM) because it needs to persist indefinitely
[[gnu::section(".fram_info.main")]]
static MSP::State _State;

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    
    // Init SPI peripheral
    static bool spiInit = false;
    if (!spiInit) {
        spiInit = true;
        _SPI::Init();
    }
    
    static bool iceInit = false;
    
    // Init ICE comms
    if (!iceInit) {
        iceInit = true;
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        _ICE::Init();
    }
    
    _SPI::WriteRead(msg, resp);
}

// MARK: - IntState

inline bool Toastbox::IntState::InterruptsEnabled() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::SetInterruptsEnabled(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    #warning TODO: re-enable LPM3.5 sleep below
    const uint16_t LPMBits = LPM1_bits;
    // If deep sleep is OK, enter LPM3.5 sleep, where RAM content is lost.
    // Otherwise, enter LPM1 sleep, because something is running.
//    const uint16_t LPMBits = (_MainTask::DeepSleepOK() ? LPM3_bits : LPM1_bits);
    
    // If we're entering LPM3, disable regulator so we enter LPM3.5 (instead of just LPM3)
    if (LPMBits == LPM3_bits) {
        PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_1_L;
    }
    
    // Atomically enable interrupts and go to sleep
    const bool prevEn = Toastbox::IntState::InterruptsEnabled();
    __bis_SR_register(GIE | LPMBits);
    // If interrupts were disabled previously, disable them again
    if (!prevEn) Toastbox::IntState::SetInterruptsEnabled(false);
}

// MARK: - Tasks

//static void debugSignal() {
//    _Pin::DEBUG_OUT::Init();
////    for (;;) {
//    for (int i=0; i<10; i++) {
//        _Pin::DEBUG_OUT::Write(0);
//        for (volatile int i=0; i<10000; i++);
//        _Pin::DEBUG_OUT::Write(1);
//        for (volatile int i=0; i<10000; i++);
//    }
//}

//class _BusyTimeoutTask {
//public:
//    static void Run() {
//        for (;;) {
////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Busy.has_value(); });
//            
//            while (_Scheduler::Wait<_BusyTimeoutTask,1000>([] { return (bool)_Busy; })) {
//                _Busy = std::nullopt;
//            }
//            
//            // Asynchronously turn off the image sensor / SD card
//            _Img::DisableAsync();
//            _SD::DisableAsync();
//            
//            // Wait until the image sensor / SD card are off
//            _Img::Wait();
//            _SD::Wait();
//            
////            // Wait to be tickled
////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Tickled; });
////
////            // Assert that we're busy until we stop getting tickled + 1s
////            _BusyAssertion busy;
////            do {
////                _Tickled = false;
////            } while ();
////
////            // Asynchronously turn off the image sensor / SD card
////            _Img::DisableAsync();
////            _SD::DisableAsync();
////
////            // Wait until the image sensor / SD card are off
////            _Img::Wait();
////            _SD::Wait();
//        }
//        
//        _Scheduler::Yield();
//    }
//    
//    
////    static void Run() {
////        for (;;) {
////            _BusyAssertion busy;
////            while (_Scheduler::Wait<_BusyTimeoutTask,1000>([] { return _Tickled; })) {
////                _Tickled = false;
////            }
////            
////            // Asynchronously turn off the image sensor / SD card
////            _Img::DisableAsync();
////            _SD::DisableAsync();
////            
////            // Wait until the image sensor / SD card are off
////            _Img::Wait();
////            _SD::Wait();
////            
//////            // Wait to be tickled
//////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Tickled; });
//////
//////            // Assert that we're busy until we stop getting tickled + 1s
//////            _BusyAssertion busy;
//////            do {
//////                _Tickled = false;
//////            } while ();
//////
//////            // Asynchronously turn off the image sensor / SD card
//////            _Img::DisableAsync();
//////            _SD::DisableAsync();
//////
//////            // Wait until the image sensor / SD card are off
//////            _Img::Wait();
//////            _SD::Wait();
////        }
////        
////        _Scheduler::Yield();
////    }
//    
////    static void Stop() {
////        _Scheduler::Stop<_BusyTimeoutTask>();
////    }
//    
//    static void Tickle() {
//        _Busy.emplace();
//    }
//    
//    // Task options
//    static constexpr Toastbox::TaskOptions Options{};
//    
//    // Task stack
//    [[gnu::section(".stack._BusyTimeoutTask")]]
//    static inline uint8_t Stack[128];
//    
//private:
//    static inline std::optional<_BusyAssertion> _Busy;
//};

struct _SDTask {
    static void Enable() {
        Wait();
        // Short-circuit if the state didn't change
        if (_Enabled) return;
        _Scheduler::Start<_SDTask>([] { _Enable(); });
    }
    
    static void Disable() {
        Wait();
        // Short-circuit if the state didn't change
        if (!_Enabled) return;
        _Scheduler::Start<_SDTask>([] { _Disable(); });
    }
    
    static void WriteImage(uint8_t srcBlock, uint32_t dstBlockIdx) {
        static struct {
            uint8_t srcBlock;
            uint32_t dstBlockIdx;
        } Args;
        
