toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._SDTask")]]
    static inline uint8_t Stack[256];
};

struct _ImgTask {
    static void Enable() {
        Wait();
        // Short-circuit if the state didn't change
        if (_Enabled) return;
        _Scheduler::Start<_ImgTask>([] { _Enable(); });
    }
    
    static void Disable() {
        Wait();
        // Short-circuit if the state didn't change
        if (!_Enabled) return;
        _Scheduler::Start<_ImgTask>([] { _Disable(); });
    }
    
    static void Wait() {
        _Scheduler::Wait<_ImgTask>();
    }
    
    static Img::AutoExposure& AutoExp() {
        return _AutoExp;
    }
    
    static void _Enable() {
        Assert(!_Enabled);
        
        // Enable the power rails
        _SetPowerEnabled(true);
        // Initialize image sensor
        _ImgSensor::Init();
        // Set the initial exposure _before_ we enable streaming, so that the very first frame
        // has the correct exposure, so we don't have to skip any frames on the first capture.
        _ImgSensor::SetCoarseIntTime(_AutoExp.integrationTime());
        // Enable image streaming
        _ImgSensor::SetStreamEnabled(true);
        
        _Enabled = true;
    }
    
    static void _Disable() {
        Assert(_Enabled);
        
        _SetPowerEnabled(false);
        _Enabled = false;
    }
    
    static void _SetPowerEnabled(bool en) {
        // Short-circuit if the pin state hasn't changed, to save us the Sleep()
        if (_Pin::VDD_B_2V8_IMG_EN::Read()==en &&
            _Pin::VDD_B_1V8_IMG_EN::Read()==en) return;
        
        if (en) {
            _Pin::VDD_B_2V8_IMG_EN::Write(1);
            _Scheduler::Sleep(_Scheduler::Us(100)); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
            _Pin::VDD_B_1V8_IMG_EN::Write(1);
            
            #warning measure actual delay that we need for the rails to rise
        
        } else {
            // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
            _Pin::VDD_B_1V8_IMG_EN::Write(0);
            _Pin::VDD_B_2V8_IMG_EN::Write(0);
            
            #warning measure actual delay that we need for the rails to fall
        }
    }
    
    // _AutoExp: auto exposure algorithm object
    // Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    [[gnu::section(".ram_backup.main")]]
    static inline Img::AutoExposure _AutoExp;
    
    static inline bool _Enabled = false;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._ImgTask")]]
    static inline uint8_t Stack[128];
};

struct _MainTask {
    static void Run() {
//        for (;;) {
//            _Pin::VDD_B_EN::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//            
//            _Pin::VDD_B_EN::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//        }
//        
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(500));
//        
//        for (;;) {
//            _Pin::DEBUG_OUT::Write(1);
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//            
//            _Pin::DEBUG_OUT::Write(0);
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//        }
        
        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(2000));
            
            // Wait for motion. During this block we allow LPM3.5 sleep, as long as our other tasks are idle.
            {
                _WaitingForMotion = true;
                _Scheduler::Wait([&] { return (bool)_Motion; });
                _Motion = false;
                _WaitingForMotion = false;
            }
            
            _Pin::VDD_B_EN::Write(1);
            #warning TODO: this delay is needed for the ICE40 to start, but we need to speed it up, see Notes.txt
            _Scheduler::Sleep(_Scheduler::Ms(250));
            
            // Enable image sensor / SD card
            _ImgTask::Enable();
            _SDTask::Enable();
            
            for (;;) {
                // Capture an image
                {
                    _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
                    
                    _ImgTask::Wait(); // Wait until the image sensor is ready before we attempt to capture an image
                    _ImgCapture(_SDTask::ImgRingBuf());
                    
                    _ICE::Transfer(_ICE::LEDSetMsg(0x00));
                }
                
                // Wait up to 1s for further motion
                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
                if (!motion) break;
                
                // Only reset _Motion if we've observed motion; otherwise, if we always reset
                // _Motion, there'd be a race window where we could first observe
                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
                // the true value by resetting it to false.
                _Motion = false;
            }
            
            // We haven't had motion in a while; power down
            _ImgTask::Disable();
            _SDTask::Disable();
            
            _Pin::VDD_B_EN::Write(0);
            
//            // Asynchronously turn off the image sensor / SD card
//            _Img::DisableAsync();
//            _SD::DisableAsync();
//            
//            _Scheduler::Wait([&] { return (_Img && _SD) || _Motion; });
//            
//            // Wait until the image sensor / SD card are off
//            _Img::Wait();
//            _SD::Wait();
//            
//            // Wait for motion
//            const bool motion = _Scheduler::WaitTimeout<1000>([&] { return _Motion; });
//            
//            if (motion) {
//                _Motion = false;
//                
//                // Capture an image
//                _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//                _ImgCapture();
//                _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            
//            } else {
//                // Asynchronously turn off the image sensor / SD card
//                _Img::DisableAsync();
//                _SD::DisableAsync();
//                
//                // Wait until the image sensor / SD card are off
//                _Img::Wait();
//                _SD::Wait();
//                
//                break;
//            }
//            
//            
//            
////            // Stop the timeout task while we capture a new image
////            _Scheduler::Stop<_BusyTimeoutTask>();
//            
//            
//            // Wait for motion
//            _Scheduler::Wait([&] { return _Motion; });
//            _Motion = false;
//            
//            _BusyAssertion busy;
//            
////            // Stop the timeout task while we capture a new image
////            _Scheduler::Stop<_BusyTimeoutTask>();
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            
//            // Capture an image
//            _ImgCapture();
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            
//            // wait for motion or 1s to elapse
//            // if motion:
//            //   capture another image
//            // if 1s elapses:
//            //   disable SD/Img
//            //   wait for: [1] _Motion or [2] (SD && Img)
//            //   if [1]: capture another image
//            //   if [2]: drop busy assertion and yield
//            
//            
//            // Tickle the busy task
//            _BusyTimeoutTask::Tickle();
//            
////            // Restart the timeout task, so that we turn off automatically if
////            // we're idle for a bit
////            _Scheduler::Start<_BusyTimeoutTask>(_BusyTimeoutTask::Run);
        }
    }
    
    static bool DeepSleepOK() {
        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
        // This logic works because if _WaitingForMotion==true, then we've disabled both _SDTask
        // and _ImgTask, so if the tasks are idle, then everything's idle so we can enter deep
        // sleep. (The case that we need to be careful of is going to sleep when either _SDTask
        // or _ImgTask is idle but still powered on, and this logic takes care of that.)
        return _WaitingForMotion                &&
               !_Scheduler::Running<_SDTask>()  &&
               !_Scheduler::Running<_ImgTask>() ;
    }
    
    static void MotionSignal() {
        _Motion = true;
    }
    
    static void _ImgCapture(const MSP::ImgRingBuf& imgRingBuf) {
        // Try up to `CaptureAttemptCount` times to capture a properly-exposed image
        constexpr uint8_t CaptureAttemptCount = 3;
        uint8_t bestExpBlock = 0;
        uint8_t bestExpScore = 0;
        for (uint8_t i=0; i<CaptureAttemptCount; i++) {
            // skipCount:
            // On the initial capture, we didn't set the exposure, so we don't need to skip any images.
            // On subsequent captures, we did set the exposure before the capture, so we need to skip a single
            // image since the first image after setting the exposure is invalid.
            const uint8_t skipCount = (!i ? 0 : 1);
            
            // expBlock: Store images in the block belonging to the worst-exposed image captured so far
            const uint8_t expBlock = !bestExpBlock;
            
            // Populate the header
            static Img::Header header = {
                .magic          = Img::Header::MagicNumber,
                .version        = Img::Header::Version,
                .imageWidth     = Img::PixelWidth,
                .imageHeight    = Img::PixelHeight,
                .coarseIntTime  = 0,
                .analogGain     = 0,
                .id             = 0,
                .timestamp      = 0,
            };
            
