toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            header.coarseIntTime = _ImgTask::AutoExp().integrationTime();
            header.id = imgRingBuf.buf.idEnd;
            header.timestamp = _RTC.time();
            
            // Capture an image to RAM
            const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
            const uint8_t expScore = _ImgTask::AutoExp().update(resp.highlightCount(), resp.shadowCount());
            if (!bestExpScore || (expScore > bestExpScore)) {
                bestExpBlock = expBlock;
                bestExpScore = expScore;
            }
            
            // We're done if we don't have any exposure changes
            if (!_ImgTask::AutoExp().changed()) break;
            
            // Update the exposure
            _ImgSensor::SetCoarseIntTime(_ImgTask::AutoExp().integrationTime());
        }
        
        // Write the best-exposed image to the SD card
        const uint32_t dstBlockIdx = imgRingBuf.buf.widx * ImgSD::ImgBlockCount;
        _SDTask::WriteImage(bestExpBlock, dstBlockIdx);
    }
    
    // _Motion: announces that motion occurred
    // atomic because _Motion is modified from the interrupt context
    static inline std::atomic<bool> _Motion = false;
    static inline bool _WaitingForMotion = false;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .AutoStart = Run, // Task should start running
    };
    
    // Task stack
    [[gnu::section(".stack._MainTask")]]
    static inline uint8_t Stack[256];
};

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC.isr();
}

[[gnu::interrupt(PORT1_VECTOR)]]
static void _ISR_Port1() {
    // Accessing `P1IV` automatically clears the highest-priority interrupt
    switch (__even_in_range(P1IV, _MotionSignalIV)) {
    case _MotionSignalIV:
        _MainTask::MotionSignal();
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

// MARK: - Abort

namespace AbortDomain {
    static constexpr uint16_t Invalid       = 0;
    static constexpr uint16_t General       = 1;
    static constexpr uint16_t Scheduler     = 2;
    static constexpr uint16_t ICE           = 3;
    static constexpr uint16_t SD            = 4;
    static constexpr uint16_t Img           = 5;
}

[[noreturn]]
static void _SchedulerError(uint16_t line) {
    _Abort(AbortDomain::Scheduler, line);
}

[[noreturn]]
static void _ICEError(uint16_t line) {
    _Abort(AbortDomain::ICE, line);
}

[[noreturn]]
static void _SDError(uint16_t line) {
    _Abort(AbortDomain::SD, line);
}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _Abort(AbortDomain::Img, line);
}

static void _AbortRecord(const MSP::Time& timestamp, uint16_t domain, uint16_t line) {
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    auto& abort = _State.abort;
    if (abort.eventsCount >= std::size(abort.events)) return;
    
    abort.events[abort.eventsCount] = MSP::AbortEvent{
        .timestamp = timestamp,
        .domain = domain,
        .line = line,
    };
    
    abort.eventsCount++;
}

[[noreturn]]
static void _BOR() {
    PMMCTL0 = PMMPW | PMMSWBOR;
    for (;;);
}

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line) {
    const MSP::Time timestamp = _RTC.time();
    // Record the abort
    _AbortRecord(timestamp, domain, line);
    _BOR();
//    // Trigger a BOR
//    PMMCTL0 = PMMPW | PMMSWBOR;
    
//    PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
//    PMMCTL0_L |= PMMSWBOR_1_L;
    
//    for (;;);
    
//    _Pin::DEBUG_OUT::Init();
//    
//    for (;;) {
//        for (uint16_t i=0; i<(uint16_t)domain; i++) {
//            _Pin::DEBUG_OUT::Write(1);
//            _Pin::DEBUG_OUT::Write(0);
//        }
//        
//        for (volatile int i=0; i<100; i++) {}
//        
//        for (uint16_t i=0; i<(uint16_t)line; i++) {
//            _Pin::DEBUG_OUT::Write(1);
//            _Pin::DEBUG_OUT::Write(0);
//        }
//        
//        for (volatile int i=0; i<1000; i++) {}
//    }
}

extern "C" [[noreturn]]
void abort() {
    _Abort(AbortDomain::General, 0);
}

// MARK: - Main

#warning verify that _StackMainSize is large enough
#define _StackMainSize 128

[[gnu::section(".stack.main")]]
uint8_t _StackMain[_StackMainSize];

asm(".global __stack");
asm(".equ __stack, _StackMain+" Stringify(_StackMainSize));

[[noreturn]]
static void _HostMode() {
    // Let power rails fully discharge before turning them on
    _Scheduler::Delay(_Scheduler::Ms(100));
    
    _Pin::VDD_B_EN::Write(1);
    _Pin::VDD_B_1V8_IMG_EN::Write(1);
    _Pin::VDD_B_2V8_IMG_EN::Write(1);
    _Pin::VDD_B_SD_EN::Write(1);
    
    while (!_Pin::HOST_MODE_::Read()) {
        _Scheduler::Delay(_Scheduler::Ms(100));
    }
    
    _BOR();
    
//    _Pin::VDD_B_EN::Write(0);
//    _Pin::VDD_B_1V8_IMG_EN::Write(0);
//    _Pin::VDD_B_2V8_IMG_EN::Write(0);
//    _Pin::VDD_B_SD_EN::Write(0);
}

int main() {
    // Stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;
    
//    if (Startup::ColdStart()) {
//        
//        // Init GPIOs
//        GPIO::Init<
//            // Main Pins
//            _Pin::HOST_MODE_,
//            
//            // Clock pins (config chosen by _RTCType)
//            _RTCType::Pin::XOUT,
//            _RTCType::Pin::XIN
//            
//    //        _Pin::DEBUG_OUT
//        >();
//        
//        
//        
//        
//        
//        
//        _Pin::HOST_MODE_::Init();
//        _RTCType::Pin::XOUT::Init();
//        _RTCType::Pin::XIN::Init();
//        
//        while (!_Pin::HOST_MODE_::Read()) {
//            _Scheduler::Delay(_Scheduler::Ms(100));
//        }
//        
//        GPIO::Init<
//            _Pin::HOST_MODE_,
//        >();
//        
//        GPIO::Init<_Pin::HOST_MODE_>
//        
//    }
//    
//    if (!_Pin::HOST_MODE_::Read()) {
//        while (!_Pin::HOST_MODE_::Read()) {
//            _Scheduler::Delay(_Scheduler::Ms(100));
//        }
//        _BOR();
//    }
//    
//    // Init RTC
//    // We need RTC to be unconditionally enabled for 2 reasons:
//    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
//    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
//    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
//    const MSP::Time time = _State.time;
//    if (time) {
//        // If `time` is valid, consume it before handing it off to _RTC.
//        FRAMWriteEn writeEn; // Enable FRAM writing
//        // Reset `_State.time` before consuming it, so that if we lose power,
//        // the time won't be reused again
//        _State.time = 0;
//        std::atomic_signal_fence(std::memory_order_seq_cst);
//    }
//    _RTC.init(time);
//    
//    // If this is a cold start, wait until HOST_MODE_ is high.
//    // STM32 controls HOST_MODE_ to control when we start executing, in order to implement mutual
//    // exclusion on controlling the power rails and talking to ICE40.
//    if (Startup::ColdStart()) {
//        _BusyAssertion busy; // Prevent LPM3.5 sleep during the delay
//        while (!_Pin::HOST_MODE_::Read()) {
//            _Scheduler::Delay(_Scheduler::Ms(100));
////            debugSignal();
//        }
//        
////        _Pin::DEBUG_OUT::Init();
////        while (!_Pin::HOST_MODE_::Read()) {
////            _Pin::DEBUG_OUT::Write(1);
////            _Scheduler::Delay(_Scheduler::Ms(50));
////            _Pin::DEBUG_OUT::Write(0);
////            _Scheduler::Delay(_Scheduler::Ms(50));
////        }
//        
//        // Once we're allowed to run, disable the pullup on HOST_MODE_ to prevent the leakage current (~80nA)
//        // through STM32's GPIO that controls HOST_MODE_.
//        using HOST_MODE__PULLDOWN = _Pin::HOST_MODE_::Opts<Option::Input, Option::Resistor0>;
//        HOST_MODE__PULLDOWN::Init();
//    }
    
    
    
