toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
//    volatile bool a = false;
//    while (!a);
    
    // Init GPIOs
    GPIO::Init<
        // Main Pins
        _Pin::VDD_B_1V8_IMG_EN,
        _Pin::VDD_B_2V8_IMG_EN,
        _Pin::VDD_B_SD_EN,
        _Pin::VDD_B_EN,
        _Pin::MOTION_SIGNAL,
        _Pin::HOST_MODE_,
        
        // SPI pins (config chosen by _SPI)
        _SPI::Pin::Clk,
        _SPI::Pin::DataOut,
        _SPI::Pin::DataIn,
        
        // Clock pins (config chosen by _RTCType)
        _RTCType::Pin::XOUT,
        _RTCType::Pin::XIN
        
//        _Pin::DEBUG_OUT
    >();
    
    // Init clock
    _Clock::Init();
    
//    debugSignal();
    
    #warning if this is a cold start:
    #warning   wait a few milliseconds to allow our outputs to settle so that our peripherals
    #warning   (SD card, image sensor) fully turn off, because we may have restarted because
    #warning   of an error
    
    #warning we're currently sleeping before we abort -- move that sleep here instead.
    
    #warning how do we handle turning off SD clock after an error occurs?
    #warning   ? dont worry about that because in the final design,
    #warning   well be powering off ICE40 anyway?
    
    // Start RTC if it's not currently enabled.
    // We need RTC to be unconditionally enabled for 2 reasons:
    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
//    const MSP::Time time = _State.time;
//    if (time) {
//        {
//            // If `time` is valid, consume it and hand it off to _RTC.
//            FRAMWriteEn writeEn; // Enable FRAM writing
//            
//            // Reset `_State.time` before consuming it, so that if we lose power,
//            // the time won't be reused again
//            _State.time = 0;
//            std::atomic_signal_fence(std::memory_order_seq_cst);
//        }
//        
//        // Init real-time clock
//        _RTC.init(time);
//    
//    // Otherwise, we don't have a valid time, so if _RTC isn't currently
//    // enabled, init _RTC with 0.
//    } else if (!_RTC.enabled()) {
//        _RTC.init(0);
//    }
    
    // Init RTC
    // We need RTC to be unconditionally enabled for 2 reasons:
    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
    MSP::Time startTime = 0;
    if (_State.startTime.valid) {
        // If `time` is valid, consume it before handing it off to _RTC.
        FRAMWriteEn writeEn; // Enable FRAM writing
        // Reset `valid` before consuming the start time, so that if we lose power,
        // the time won't be reused again
        _State.startTime.valid = false;
        std::atomic_signal_fence(std::memory_order_seq_cst);
    }
    _RTC.init(startTime);
    
    // Init SysTick
    _SysTick::Init();
    
    // Handle cold starts
    if (Startup::ColdStart()) {
        // Temporarily enable a pullup on HOST_MODE_ so that we can determine whether STM is driving it low.
        // We don't want the pullup to be permanent to prevent leakage current (~80nA) through STM32's GPIO
        // that controls HOST_MODE_.
        using HOST_MODE_PULLUP = _Pin::HOST_MODE_::Opts<Option::Input, Option::Resistor1>;
        HOST_MODE_PULLUP::Init();
        
        // Wait for the pullup to pull the rail up
        _Scheduler::Delay(_Scheduler::Ms(1));
        
        // Enter host mode if HOST_MODE_ is asserted
        if (!_Pin::HOST_MODE_::Read()) {
            _HostMode();
        }
        
        // Return HOST_MODE_ config
        _Pin::HOST_MODE_::Init();
        
        // Since this is a cold start, delay 3s before beginning.
        // This delay is meant for the case where we restarted due to an abort, and
        // serves 2 purposes:
        //   1. it rate-limits aborts, in case there's a persistent issue
        //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
        _Scheduler::Delay(_Scheduler::Ms(3000));
    }
    
//    // If this is a cold start, delay 3s before beginning.
//    // This delay is meant for the case where we restarted due to an abort, and
//    // serves 2 purposes:
//    //   1. it rate-limits aborts, in case there's a persistent issue
//    //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
//    if (Startup::ColdStart()) {
////        #warning TODO: VDD_B_EN needs to be controlled elsewhere when we implement proper power rail control
////        // Turn on VDD_B
////        _Pin::VDD_B_EN::Write(1);
//        
//        _BusyAssertion busy; // Prevent LPM3.5 sleep during the delay
//        _Scheduler::Delay(_Scheduler::Ms(3000));
//    }
    
//    debugSignal();
    _Scheduler::Run();
}




//#warning TODO: remove these debug symbols
//#warning TODO: when we remove these, re-enable: Project > Optimization > Place [data/functions] in own section
//constexpr auto& _Debug_Tasks              = _Scheduler::_Tasks;
//constexpr auto& _Debug_DidWork            = _Scheduler::_DidWork;
//constexpr auto& _Debug_CurrentTask        = _Scheduler::_CurrentTask;
//constexpr auto& _Debug_CurrentTime        = _Scheduler::_ISR.CurrentTime;
//constexpr auto& _Debug_Wake               = _Scheduler::_ISR.Wake;
//constexpr auto& _Debug_WakeTime           = _Scheduler::_ISR.WakeTime;
//
//struct _DebugStack {
//    uint16_t stack[_StackGuardCount];
//};
//
//const _DebugStack& _Debug_MainStack               = *(_DebugStack*)_StackMain;
//const _DebugStack& _Debug_MainTaskStack         = *(_DebugStack*)_MainTask::Stack;
//const _DebugStack& _Debug_SDTaskStack             = *(_DebugStack*)_SDTask::Stack;
//const _DebugStack& _Debug_ImgTaskStack            = *(_DebugStack*)_ImgTask::Stack;
